{
  "intent_to_id": {
    "abbreviation": 0,
    "aircraft": 1,
    "airfare": 2,
    "airline": 3,
    "airline+flight_no": 4,
    "airport": 5,
    "capacity": 6,
    "city": 7,
    "distance": 8,
    "flight": 9,
    "flight+airfare": 10,
    "flight_no": 11,
    "flight_time": 12,
    "ground_fare": 13,
    "ground_service": 14,
    "meal": 15,
    "quantity": 16,
    "restriction": 17
  },
  "id_to_intent": {
    "0": "abbreviation",
    "1": "aircraft",
    "2": "airfare",
    "3": "airline",
    "4": "airline+flight_no",
    "5": "airport",
    "6": "capacity",
    "7": "city",
    "8": "distance",
    "9": "flight",
    "10": "flight+airfare",
    "11": "flight_no",
    "12": "flight_time",
    "13": "ground_fare",
    "14": "ground_service",
    "15": "meal",
    "16": "quantity",
    "17": "restriction"
  },
  "slot_to_id": {
    "B-aircraft_code": 0,
    "B-airline_code": 1,
    "B-airline_name": 2,
    "B-airport_code": 3,
    "B-airport_name": 4,
    "B-arrive_date.date_relative": 5,
    "B-arrive_date.day_name": 6,
    "B-arrive_date.day_number": 7,
    "B-arrive_date.month_name": 8,
    "B-arrive_date.today_relative": 9,
    "B-arrive_time.end_time": 10,
    "B-arrive_time.period_mod": 11,
    "B-arrive_time.period_of_day": 12,
    "B-arrive_time.start_time": 13,
    "B-arrive_time.time": 14,
    "B-arrive_time.time_relative": 15,
    "B-city_name": 16,
    "B-class_type": 17,
    "B-connect": 18,
    "B-cost_relative": 19,
    "B-day_name": 20,
    "B-day_number": 21,
    "B-days_code": 22,
    "B-depart_date.date_relative": 23,
    "B-depart_date.day_name": 24,
    "B-depart_date.day_number": 25,
    "B-depart_date.month_name": 26,
    "B-depart_date.today_relative": 27,
    "B-depart_date.year": 28,
    "B-depart_time.end_time": 29,
    "B-depart_time.period_mod": 30,
    "B-depart_time.period_of_day": 31,
    "B-depart_time.start_time": 32,
    "B-depart_time.time": 33,
    "B-depart_time.time_relative": 34,
    "B-economy": 35,
    "B-fare_amount": 36,
    "B-fare_basis_code": 37,
    "B-flight_days": 38,
    "B-flight_mod": 39,
    "B-flight_number": 40,
    "B-flight_stop": 41,
    "B-flight_time": 42,
    "B-fromloc.airport_code": 43,
    "B-fromloc.airport_name": 44,
    "B-fromloc.city_name": 45,
    "B-fromloc.state_code": 46,
    "B-fromloc.state_name": 47,
    "B-meal": 48,
    "B-meal_code": 49,
    "B-meal_description": 50,
    "B-mod": 51,
    "B-month_name": 52,
    "B-or": 53,
    "B-period_of_day": 54,
    "B-restriction_code": 55,
    "B-return_date.date_relative": 56,
    "B-return_date.day_name": 57,
    "B-return_date.day_number": 58,
    "B-return_date.month_name": 59,
    "B-return_date.today_relative": 60,
    "B-return_time.period_mod": 61,
    "B-return_time.period_of_day": 62,
    "B-round_trip": 63,
    "B-state_code": 64,
    "B-state_name": 65,
    "B-stoploc.airport_name": 66,
    "B-stoploc.city_name": 67,
    "B-stoploc.state_code": 68,
    "B-time": 69,
    "B-time_relative": 70,
    "B-today_relative": 71,
    "B-toloc.airport_code": 72,
    "B-toloc.airport_name": 73,
    "B-toloc.city_name": 74,
    "B-toloc.country_name": 75,
    "B-toloc.state_code": 76,
    "B-toloc.state_name": 77,
    "B-transport_type": 78,
    "I-airline_name": 79,
    "I-airport_name": 80,
    "I-arrive_date.day_number": 81,
    "I-arrive_time.end_time": 82,
    "I-arrive_time.period_of_day": 83,
    "I-arrive_time.start_time": 84,
    "I-arrive_time.time": 85,
    "I-arrive_time.time_relative": 86,
    "I-city_name": 87,
    "I-class_type": 88,
    "I-cost_relative": 89,
    "I-depart_date.day_name": 90,
    "I-depart_date.day_number": 91,
    "I-depart_date.today_relative": 92,
    "I-depart_time.end_time": 93,
    "I-depart_time.period_of_day": 94,
    "I-depart_time.start_time": 95,
    "I-depart_time.time": 96,
    "I-depart_time.time_relative": 97,
    "I-economy": 98,
    "I-fare_amount": 99,
    "I-fare_basis_code": 100,
    "I-flight_mod": 101,
    "I-flight_stop": 102,
    "I-flight_time": 103,
    "I-fromloc.airport_name": 104,
    "I-fromloc.city_name": 105,
    "I-fromloc.state_name": 106,
    "I-meal_code": 107,
    "I-meal_description": 108,
    "I-mod": 109,
    "I-restriction_code": 110,
    "I-return_date.date_relative": 111,
    "I-return_date.day_number": 112,
    "I-return_date.today_relative": 113,
    "I-round_trip": 114,
    "I-stoploc.city_name": 115,
    "I-time": 116,
    "I-today_relative": 117,
    "I-toloc.airport_name": 118,
    "I-toloc.city_name": 119,
    "I-toloc.state_name": 120,
    "I-transport_type": 121,
    "O": 122
  },
  "id_to_slot": {
    "0": "B-aircraft_code",
    "1": "B-airline_code",
    "2": "B-airline_name",
    "3": "B-airport_code",
    "4": "B-airport_name",
    "5": "B-arrive_date.date_relative",
    "6": "B-arrive_date.day_name",
    "7": "B-arrive_date.day_number",
    "8": "B-arrive_date.month_name",
    "9": "B-arrive_date.today_relative",
    "10": "B-arrive_time.end_time",
    "11": "B-arrive_time.period_mod",
    "12": "B-arrive_time.period_of_day",
    "13": "B-arrive_time.start_time",
    "14": "B-arrive_time.time",
    "15": "B-arrive_time.time_relative",
    "16": "B-city_name",
    "17": "B-class_type",
    "18": "B-connect",
    "19": "B-cost_relative",
    "20": "B-day_name",
    "21": "B-day_number",
    "22": "B-days_code",
    "23": "B-depart_date.date_relative",
    "24": "B-depart_date.day_name",
    "25": "B-depart_date.day_number",
    "26": "B-depart_date.month_name",
    "27": "B-depart_date.today_relative",
    "28": "B-depart_date.year",
    "29": "B-depart_time.end_time",
    "30": "B-depart_time.period_mod",
    "31": "B-depart_time.period_of_day",
    "32": "B-depart_time.start_time",
    "33": "B-depart_time.time",
    "34": "B-depart_time.time_relative",
    "35": "B-economy",
    "36": "B-fare_amount",
    "37": "B-fare_basis_code",
    "38": "B-flight_days",
    "39": "B-flight_mod",
    "40": "B-flight_number",
    "41": "B-flight_stop",
    "42": "B-flight_time",
    "43": "B-fromloc.airport_code",
    "44": "B-fromloc.airport_name",
    "45": "B-fromloc.city_name",
    "46": "B-fromloc.state_code",
    "47": "B-fromloc.state_name",
    "48": "B-meal",
    "49": "B-meal_code",
    "50": "B-meal_description",
    "51": "B-mod",
    "52": "B-month_name",
    "53": "B-or",
    "54": "B-period_of_day",
    "55": "B-restriction_code",
    "56": "B-return_date.date_relative",
    "57": "B-return_date.day_name",
    "58": "B-return_date.day_number",
    "59": "B-return_date.month_name",
    "60": "B-return_date.today_relative",
    "61": "B-return_time.period_mod",
    "62": "B-return_time.period_of_day",
    "63": "B-round_trip",
    "64": "B-state_code",
    "65": "B-state_name",
    "66": "B-stoploc.airport_name",
    "67": "B-stoploc.city_name",
    "68": "B-stoploc.state_code",
    "69": "B-time",
    "70": "B-time_relative",
    "71": "B-today_relative",
    "72": "B-toloc.airport_code",
    "73": "B-toloc.airport_name",
    "74": "B-toloc.city_name",
    "75": "B-toloc.country_name",
    "76": "B-toloc.state_code",
    "77": "B-toloc.state_name",
    "78": "B-transport_type",
    "79": "I-airline_name",
    "80": "I-airport_name",
    "81": "I-arrive_date.day_number",
    "82": "I-arrive_time.end_time",
    "83": "I-arrive_time.period_of_day",
    "84": "I-arrive_time.start_time",
    "85": "I-arrive_time.time",
    "86": "I-arrive_time.time_relative",
    "87": "I-city_name",
    "88": "I-class_type",
    "89": "I-cost_relative",
    "90": "I-depart_date.day_name",
    "91": "I-depart_date.day_number",
    "92": "I-depart_date.today_relative",
    "93": "I-depart_time.end_time",
    "94": "I-depart_time.period_of_day",
    "95": "I-depart_time.start_time",
    "96": "I-depart_time.time",
    "97": "I-depart_time.time_relative",
    "98": "I-economy",
    "99": "I-fare_amount",
    "100": "I-fare_basis_code",
    "101": "I-flight_mod",
    "102": "I-flight_stop",
    "103": "I-flight_time",
    "104": "I-fromloc.airport_name",
    "105": "I-fromloc.city_name",
    "106": "I-fromloc.state_name",
    "107": "I-meal_code",
    "108": "I-meal_description",
    "109": "I-mod",
    "110": "I-restriction_code",
    "111": "I-return_date.date_relative",
    "112": "I-return_date.day_number",
    "113": "I-return_date.today_relative",
    "114": "I-round_trip",
    "115": "I-stoploc.city_name",
    "116": "I-time",
    "117": "I-today_relative",
    "118": "I-toloc.airport_name",
    "119": "I-toloc.city_name",
    "120": "I-toloc.state_name",
    "121": "I-transport_type",
    "122": "O"
  },
  "entity_to_id": {
    "aircraft_code": 0,
    "airline_code": 1,
    "airline_name": 2,
    "airport_code": 3,
    "airport_name": 4,
    "arrive_date.date_relative": 5,
    "arrive_date.day_name": 6,
    "arrive_date.day_number": 7,
    "arrive_date.month_name": 8,
    "arrive_date.today_relative": 9,
    "arrive_time.end_time": 10,
    "arrive_time.period_mod": 11,
    "arrive_time.period_of_day": 12,
    "arrive_time.start_time": 13,
    "arrive_time.time": 14,
    "arrive_time.time_relative": 15,
    "city_name": 16,
    "class_type": 17,
    "connect": 18,
    "cost_relative": 19,
    "day_name": 20,
    "day_number": 21,
    "days_code": 22,
    "depart_date.date_relative": 23,
    "depart_date.day_name": 24,
    "depart_date.day_number": 25,
    "depart_date.month_name": 26,
    "depart_date.today_relative": 27,
    "depart_date.year": 28,
    "depart_time.end_time": 29,
    "depart_time.period_mod": 30,
    "depart_time.period_of_day": 31,
    "depart_time.start_time": 32,
    "depart_time.time": 33,
    "depart_time.time_relative": 34,
    "economy": 35,
    "fare_amount": 36,
    "fare_basis_code": 37,
    "flight_days": 38,
    "flight_mod": 39,
    "flight_number": 40,
    "flight_stop": 41,
    "flight_time": 42,
    "fromloc.airport_code": 43,
    "fromloc.airport_name": 44,
    "fromloc.city_name": 45,
    "fromloc.state_code": 46,
    "fromloc.state_name": 47,
    "meal": 48,
    "meal_code": 49,
    "meal_description": 50,
    "mod": 51,
    "month_name": 52,
    "or": 53,
    "period_of_day": 54,
    "restriction_code": 55,
    "return_date.date_relative": 56,
    "return_date.day_name": 57,
    "return_date.day_number": 58,
    "return_date.month_name": 59,
    "return_date.today_relative": 60,
    "return_time.period_mod": 61,
    "return_time.period_of_day": 62,
    "round_trip": 63,
    "state_code": 64,
    "state_name": 65,
    "stoploc.airport_name": 66,
    "stoploc.city_name": 67,
    "stoploc.state_code": 68,
    "time": 69,
    "time_relative": 70,
    "today_relative": 71,
    "toloc.airport_code": 72,
    "toloc.airport_name": 73,
    "toloc.city_name": 74,
    "toloc.country_name": 75,
    "toloc.state_code": 76,
    "toloc.state_name": 77,
    "transport_type": 78
  },
  "id_to_entity": {
    "0": "aircraft_code",
    "1": "airline_code",
    "2": "airline_name",
    "3": "airport_code",
    "4": "airport_name",
    "5": "arrive_date.date_relative",
    "6": "arrive_date.day_name",
    "7": "arrive_date.day_number",
    "8": "arrive_date.month_name",
    "9": "arrive_date.today_relative",
    "10": "arrive_time.end_time",
    "11": "arrive_time.period_mod",
    "12": "arrive_time.period_of_day",
    "13": "arrive_time.start_time",
    "14": "arrive_time.time",
    "15": "arrive_time.time_relative",
    "16": "city_name",
    "17": "class_type",
    "18": "connect",
    "19": "cost_relative",
    "20": "day_name",
    "21": "day_number",
    "22": "days_code",
    "23": "depart_date.date_relative",
    "24": "depart_date.day_name",
    "25": "depart_date.day_number",
    "26": "depart_date.month_name",
    "27": "depart_date.today_relative",
    "28": "depart_date.year",
    "29": "depart_time.end_time",
    "30": "depart_time.period_mod",
    "31": "depart_time.period_of_day",
    "32": "depart_time.start_time",
    "33": "depart_time.time",
    "34": "depart_time.time_relative",
    "35": "economy",
    "36": "fare_amount",
    "37": "fare_basis_code",
    "38": "flight_days",
    "39": "flight_mod",
    "40": "flight_number",
    "41": "flight_stop",
    "42": "flight_time",
    "43": "fromloc.airport_code",
    "44": "fromloc.airport_name",
    "45": "fromloc.city_name",
    "46": "fromloc.state_code",
    "47": "fromloc.state_name",
    "48": "meal",
    "49": "meal_code",
    "50": "meal_description",
    "51": "mod",
    "52": "month_name",
    "53": "or",
    "54": "period_of_day",
    "55": "restriction_code",
    "56": "return_date.date_relative",
    "57": "return_date.day_name",
    "58": "return_date.day_number",
    "59": "return_date.month_name",
    "60": "return_date.today_relative",
    "61": "return_time.period_mod",
    "62": "return_time.period_of_day",
    "63": "round_trip",
    "64": "state_code",
    "65": "state_name",
    "66": "stoploc.airport_name",
    "67": "stoploc.city_name",
    "68": "stoploc.state_code",
    "69": "time",
    "70": "time_relative",
    "71": "today_relative",
    "72": "toloc.airport_code",
    "73": "toloc.airport_name",
    "74": "toloc.city_name",
    "75": "toloc.country_name",
    "76": "toloc.state_code",
    "77": "toloc.state_name",
    "78": "transport_type"
  },
  "model_name": "ProsusAI/finbert",
  "num_intents": 18,
  "num_slots": 123,
  "num_entities": 79,
  "max_length": 64
}